app/controllers/libraries_controller.rb

SELECT `libraries`.* FROM `libraries`
---
  def index
    @libraries = Library.all

SELECT `libraries`.* FROM `libraries` WHERE `libraries`.`id` = 1 LIMIT 1
---
  def show
    @library = Library.find(params[:id])

INSERT INTO `libraries` (`address`, `created_at`, `dg_name`, `gmaps`, `latitude`, `longitude`, `name`, `places`, `updated_at`) VALUES ('1653 Av. Bourbonnière, Montréal', '2013-06-15 21:41:56', 'Martin', 1, 45.5469935, -73.53979439999999, 'Any library', 2, '2013-06-15 21:41:56')
---
  def create
    @library = Library.new(params[:library])

    respond_to do |format|
      if @library.save